; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v13 ?v7)
             (pred_8 ?v12 ?v9)
             (pred_4 ?v13 ?v9)
             (pred_5 ?v1 ?v13 )
	     (pred_3 ?v13)
             (pred_11 ?v8)
             (pred_12 ?v12)
             (pred_7 ?v9)
             (pred_1 ?v13)
             (pred_6 ?v12)
             (pred_10 ?v13)
             (pred_2 ))



(:action op_5
:parameters (?v6 ?v3 ?v4 ?v5)
:precondition (and (pred_11 ?v6) (pred_11 ?v3) (pred_12 ?v4) (pred_7 ?v5)
          (pred_9 ?v6 ?v3) (pred_8 ?v4 ?v5)
                   (pred_4 ?v3 ?v5) (pred_3 ?v6) 
                   (pred_1 ?v3) (pred_6 ?v4))
:effect (and  (pred_10 ?v3) (not (pred_1 ?v3))))


(:action op_1
:parameters (?v6 ?v2)
:precondition (and (pred_11 ?v6) (pred_11 ?v2)
               (pred_3 ?v6) (pred_9 ?v6 ?v2) (pred_10 ?v2))
:effect (and (pred_3 ?v2) (not (pred_3 ?v6))))

(:action op_2
:parameters (?v6 ?v4)
:precondition (and (pred_11 ?v6) (pred_12 ?v4) 
                  (pred_3 ?v6) (pred_5 ?v4 ?v6) (pred_2 ))
:effect (and (pred_6 ?v4)
   (not (pred_5 ?v4 ?v6)) (not (pred_2 ))))


(:action op_3
:parameters (?v6 ?v11 ?v10)
:precondition (and (pred_11 ?v6) (pred_12 ?v11) (pred_12 ?v10)
                  (pred_3 ?v6) (pred_6 ?v10) (pred_5 ?v11 ?v6))
:effect (and (pred_6 ?v11) (pred_5 ?v10 ?v6)
        (not (pred_6 ?v10)) (not (pred_5 ?v11 ?v6))))

(:action op_4
:parameters (?v6 ?v4)
:precondition (and (pred_11 ?v6) (pred_12 ?v4) 
                  (pred_3 ?v6) (pred_6 ?v4))
:effect (and (pred_2 ) (pred_5 ?v4 ?v6) (not (pred_6 ?v4)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_09 obj_03 obj_17 obj_05 obj_01 obj_02 obj_19 obj_15 obj_10 obj_12 obj_04 obj_13 obj_20 obj_11 obj_18 obj_08
    obj_14 obj_16
    obj_21 obj_06 obj_07
    )

    (:init
       (pred_2)

       (pred_11 obj_09)
       (pred_11 obj_03)
       (pred_11 obj_17)
       (pred_11 obj_05)
       (pred_11 obj_01)
       (pred_11 obj_02)
       (pred_11 obj_19)
       (pred_11 obj_15)
       (pred_11 obj_10)
       (pred_11 obj_12)
       (pred_11 obj_04)
       (pred_11 obj_13)
       (pred_11 obj_20)
       (pred_11 obj_11)
       (pred_11 obj_18)
       (pred_11 obj_08)
       (pred_7 obj_14)
       (pred_7 obj_16)
       (pred_12 obj_21)
       (pred_12 obj_06)
       (pred_12 obj_07)

       (pred_9 obj_09 obj_01)
       (pred_9 obj_09 obj_03)
       (pred_9 obj_03 obj_02)
       (pred_9 obj_03 obj_17)
       (pred_9 obj_03 obj_09)
       (pred_9 obj_17 obj_19)
       (pred_9 obj_17 obj_05)
       (pred_9 obj_17 obj_03)
       (pred_9 obj_05 obj_15)
       (pred_9 obj_05 obj_17)
       (pred_9 obj_01 obj_10)
       (pred_9 obj_01 obj_02)
       (pred_9 obj_01 obj_09)
       (pred_9 obj_02 obj_12)
       (pred_9 obj_02 obj_19)
       (pred_9 obj_02 obj_03)
       (pred_9 obj_02 obj_01)
       (pred_9 obj_19 obj_04)
       (pred_9 obj_19 obj_15)
       (pred_9 obj_19 obj_17)
       (pred_9 obj_19 obj_02)
       (pred_9 obj_15 obj_13)
       (pred_9 obj_15 obj_05)
       (pred_9 obj_15 obj_19)
       (pred_9 obj_10 obj_20)
       (pred_9 obj_10 obj_12)
       (pred_9 obj_10 obj_01)
       (pred_9 obj_12 obj_11)
       (pred_9 obj_12 obj_04)
       (pred_9 obj_12 obj_02)
       (pred_9 obj_12 obj_10)
       (pred_9 obj_04 obj_18)
       (pred_9 obj_04 obj_13)
       (pred_9 obj_04 obj_19)
       (pred_9 obj_04 obj_12)
       (pred_9 obj_13 obj_08)
       (pred_9 obj_13 obj_15)
       (pred_9 obj_13 obj_04)
       (pred_9 obj_20 obj_11)
       (pred_9 obj_20 obj_10)
       (pred_9 obj_11 obj_18)
       (pred_9 obj_11 obj_12)
       (pred_9 obj_11 obj_20)
       (pred_9 obj_18 obj_08)
       (pred_9 obj_18 obj_04)
       (pred_9 obj_18 obj_11)
       (pred_9 obj_08 obj_13)
       (pred_9 obj_08 obj_18)
       (pred_1 obj_11)
       (pred_1 obj_02)
       (pred_1 obj_18)
       (pred_4  obj_11 obj_14)
       (pred_4  obj_02 obj_16)
       (pred_4  obj_18 obj_16)
       (pred_10 obj_09)
       (pred_10 obj_03)
       (pred_10 obj_17)
       (pred_10 obj_05)
       (pred_10 obj_01)
       (pred_10 obj_19)
       (pred_10 obj_15)
       (pred_10 obj_10)
       (pred_10 obj_12)
       (pred_10 obj_04)
       (pred_10 obj_13)
       (pred_10 obj_20)
       (pred_10 obj_08)

       (pred_8  obj_21 obj_14)
       (pred_8  obj_06 obj_16)
       (pred_8  obj_07 obj_14)
       (pred_5 obj_21 obj_03)
       (pred_5 obj_06 obj_08)
       (pred_5 obj_07 obj_05)
       (pred_3 obj_03)
    )

    (:goal (and
       (pred_5 obj_21 obj_01)
       (pred_5 obj_07 obj_09)
    ))
(:constraints
  (always (not (pred_3 obj_17)))
)
)

; plan
1. (op_2 obj_03 obj_21)
   deleted: (pred_5 obj_21 obj_03) (pred_2)
   added: (pred_6 obj_21)
   goals met: 0 of 2
2. (op_1 obj_03 obj_09)
   deleted: (pred_3 obj_03)
   added: (pred_3 obj_09)
   goals met: 0 of 2
3. (op_1 obj_09 obj_01)
   deleted: (pred_3 obj_09)
   added: (pred_3 obj_01)
   goals met: 0 of 2
4. (op_4 obj_01 obj_21)
   deleted: (pred_6 obj_21)
   added: (pred_2) (pred_5 obj_21 obj_01)
   goals met: 1 of 2
5. (op_1 obj_01 obj_10)
   deleted: (pred_3 obj_01)
   added: (pred_3 obj_10)
   goals met: 1 of 2
6. (op_1 obj_10 obj_12)
   deleted: (pred_3 obj_10)
   added: (pred_3 obj_12)
   goals met: 1 of 2
7. (op_1 obj_12 obj_04)
   deleted: (pred_3 obj_12)
   added: (pred_3 obj_04)
   goals met: 1 of 2
8. (op_1 obj_04 obj_19)
   deleted: (pred_3 obj_04)
   added: (pred_3 obj_19)
   goals met: 1 of 2
9. (op_1 obj_19 obj_15)
   deleted: (pred_3 obj_19)
   added: (pred_3 obj_15)
   goals met: 1 of 2
10. (op_1 obj_15 obj_05)
   deleted: (pred_3 obj_15)
   added: (pred_3 obj_05)
   goals met: 1 of 2
11. (op_2 obj_05 obj_07)
   deleted: (pred_5 obj_07 obj_05) (pred_2)
   added: (pred_6 obj_07)
   goals met: 1 of 2
12. (op_1 obj_05 obj_15)
   deleted: (pred_3 obj_05)
   added: (pred_3 obj_15)
   goals met: 1 of 2
13. (op_1 obj_15 obj_19)
   deleted: (pred_3 obj_15)
   added: (pred_3 obj_19)
   goals met: 1 of 2
14. (op_1 obj_19 obj_04)
   deleted: (pred_3 obj_19)
   added: (pred_3 obj_04)
   goals met: 1 of 2
15. (op_1 obj_04 obj_12)
   deleted: (pred_3 obj_04)
   added: (pred_3 obj_12)
   goals met: 1 of 2
16. (op_1 obj_12 obj_10)
   deleted: (pred_3 obj_12)
   added: (pred_3 obj_10)
   goals met: 1 of 2
17. (op_1 obj_10 obj_01)
   deleted: (pred_3 obj_10)
   added: (pred_3 obj_01)
   goals met: 1 of 2
18. (op_1 obj_01 obj_09)
   deleted: (pred_3 obj_01)
   added: (pred_3 obj_09)
   goals met: 1 of 2
19. (op_4 obj_09 obj_07)
   deleted: (pred_6 obj_07)
   added: (pred_2) (pred_5 obj_07 obj_09)
   goals met: 2 of 2
